---
kind: type
id: T:Autodesk.Revit.DB.TextElementType
source: html/84f0914f-b947-0d23-3d0e-aea92822c5f1.htm
---
# Autodesk.Revit.DB.TextElementType

An object that represents a text style.

## Syntax (C#)
```csharp
public class TextElementType : LineAndTextAttrSymbol
```